app/controllers/api/users_controller.rb

  def create
    birthday = Date.new(
      params[:user][:birthday][:year].to_i,
      params[:user][:birthday][:month].to_i + 1,
      params[:user][:birthday][:day].to_i + 1
    )

    @user = User.new(user_params)
    @user.birthday = birthday

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"